- UNI: sg3637, yz3453

- UNI used to create schema: sg3637

### Setting up the connection with the database server

In [18]:
import pandas as pd
import csv

In [1]:
%config SqlMagic.autocommit=False
ib.connect_db("postgresql://sg3637:P0hwduNhVw@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111")

Connected to: postgresql://sg3637:P0hwduNhVw@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111

In [20]:
import psycopg2, psycopg2.extras
conn = psycopg2.connect(host="w4111.cisxo09blonu.us-east-1.rds.amazonaws.com", dbname="w4111",
                        user="sg3637", password="P0hwduNhVw")
cur = conn.cursor()

### Creating the Tables

In [21]:
%%sql
--DROP TABLE
DROP TABLE IF EXISTS USERS, RESTAURANTS, GROUPS, COMMENTS, PICTURES, GROUP_POSTS, VISITS, REVIEW_LIKES, 
USER_JOIN_GROUPS

Done.

Empty DataFrame
Columns: []
Index: []

In [22]:
%%sql
--USERS
CREATE TABLE USERS (
    user_id int PRIMARY KEY,
    fname text NOT NULL,
    lname text NOT NULL,
    member_since timestamp NOT NULL,
    common bool NOT NULL,
    pro bool NOT NULL,
    check(
        common is TRUE or pro is TRUE
    )
);

--RESTAURANTS
CREATE TABLE RESTAURANTS (
    rest_id int PRIMARY KEY,
    name text NOT NULL,
    rating float,
    opening_hours time,
    closing_hours time,
    location text NOT NULL,
    cuisine text NOT NULL
);

--GROUPS
CREATE TABLE GROUPS (
    group_id int PRIMARY KEY,
    group_name text NOT NULL,
    group_type text NOT NULL,
    created_by int REFERENCES USERS(user_id) ON DELETE SET NULL
);

--COMMENTS
CREATE TABLE COMMENTS (
    comment_id int,
    comment text,
    stars float NOT NULL,
    rest_id int NOT NULL REFERENCES RESTAURANTS(rest_id) ON DELETE CASCADE,
    user_id int NOT NULL REFERENCES USERS(user_id) ON DELETE CASCADE,
    timestamp timestamp NOT NULL,
    PRIMARY KEY (comment_id, rest_id)
);

--PICTURES
CREATE TABLE PICTURES (
    img_url text NOT NULL,
    img_id int NOT NULL,
    rest_id int NOT NULL REFERENCES RESTAURANTS(rest_id) ON DELETE CASCADE,
    PRIMARY KEY (img_id, rest_id)
);

--GROUP_POSTS
CREATE TABLE GROUP_POSTS (
    group_id int NOT NULL REFERENCES GROUPS(group_id) ON DELETE CASCADE,
    post_id int NOT NULL,
    text text NOT NULL,
    user_id int NOT NULL REFERENCES USERS(user_id) ON DELETE CASCADE,
    timestamp timestamp NOT NULL,
    PRIMARY KEY (group_id, post_id)
);

--VISITS
CREATE TABLE VISITS (
    user_id int NOT NULL REFERENCES USERS(user_id) ON DELETE CASCADE,
    rest_id int NOT NULL REFERENCES RESTAURANTS(rest_id) ON DELETE CASCADE,
    timestamp timestamp NOT NULL,
    PRIMARY KEY (user_id, rest_id, timestamp)
);

--REVIEW_LIKES
CREATE TABLE REVIEW_LIKES (
    user_id int NOT NULL REFERENCES USERS(user_id) ,   
    comment_id int NOT NULL,
    rest_id int NOT NULL,
    FOREIGN KEY (comment_id, rest_id) REFERENCES COMMENTS(comment_id, rest_id) ON DELETE CASCADE,
    PRIMARY KEY (user_id, comment_id, rest_id)
);

--USER_JOIN_GROUPS
CREATE TABLE USER_JOIN_GROUPS (
    user_id int NOT NULL REFERENCES USERS(user_id) ON DELETE CASCADE,   
    group_id int NOT NULL REFERENCES GROUPS(group_id) ON DELETE CASCADE,
    since timestamp NOT NULL,
    PRIMARY KEY (user_id, group_id)
);

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

Empty DataFrame
Columns: []
Index: []

There were not many changes that we made to changes to the application, data modeling, or schema since Part 1 of the project as per the feedback.

Below are some minor changes that we made to the schemas:

- The 'name' attribute in the 'USERS' table was split into two attributes - 'fname' and 'lname' to capture the last name of the user.
- The 'opening times' variable in the 'RESTAURANT' table was split into two attributes - 'opening_hours' and 'closing_hours' (with datatype as timestamp) to capture both the opening and closing times of the restaurant.

### Inserting the Data

The data has been synthetically generated for each of the tables. A csv file was created and a function to parse the csv file has been created as below

In [23]:
# Insert Data Function
def insert_data(loc, query):
    with ib.open(loc, 'r') as f:
        reader = csv.reader(f)
        next(reader)
        # Skip the header row.
        for row in reader:
            cur.execute(
                query,
                row
            )
    conn.commit()

Below are the insert statements to insert the data from each of the file into the respective database.

In [24]:
#Inserting Users data
insert_data('project-data/users.csv', "INSERT INTO users VALUES (%s, %s, %s, %s, %s, %s)")
insert_data('project-data/groups.csv', "INSERT INTO groups VALUES (%s, %s, %s, %s)")

In [25]:
insert_data('project-data/user_join_groups.csv', "INSERT INTO USER_JOIN_GROUPS VALUES (%s, %s, %s)")
insert_data('project-data/group_posts.csv', "INSERT INTO group_posts VALUES (%s, %s, %s, %s, %s)")

In [26]:
insert_data('project-data/restaurants.csv', "INSERT INTO restaurants VALUES (%s, %s, %s, %s, %s, %s, %s)")
insert_data('project-data/images.csv', "INSERT INTO pictures VALUES (%s, %s, %s)")

In [27]:
insert_data('project-data/visits.csv', "INSERT INTO visits VALUES (%s, %s, %s)")
insert_data('project-data/comments.csv', "INSERT INTO comments VALUES (%s, %s, %s, %s, %s, %s)")

In [33]:
insert_data('project-data/review_likes.csv', "INSERT INTO review_likes VALUES (%s, %s, %s)")

### Queries

The below query serves the would be used in the main functionality of the app. Based on the location of the user, and preferences in terms of rating and cuisine, return the list of relevant restaurants that would be displayed to the user (in form of flashcards).

Please note that in the actual implementation, we will get the users' location through the app.

In [36]:
%%sql
select rest_id, name
from restaurants
where split_part(location,',', 1)::float  < 41 and 
        split_part(location,',', 2)::float < -71 and rating > 3 and cuisine = 'American' or cuisine = 'Indian'

2 rows affected.

   rest_id                 name
0        5  Ricardo Steak House
1        7        Chapati House

Based on the maximum number of visits by a user to restaurants with particular cuisines, the below query recommends which group the user should join. The query uses the 'like' function to search the cuisine in the name of the groups.

This query would be particularly useful if we would like to implement a recommendation service in our app.

In [38]:
%%sql
select user_id, b.group as recommended_group from(
select user_id, cuisine, n_visits, a.group, row_number() over(partition by user_id order by n_visits desc)  from
(select v.user_id, r.cuisine, count(*) as n_visits, (select group_name from groups where group_type like concat('%', r.cuisine, '%')) as group
from visits as v join users as u on v.user_id = u.user_id join restaurants as r on r.rest_id = v.rest_id
where (select group_name from groups where group_type like concat('%', r.cuisine, '%')) is not null
group by v.user_id, r.cuisine
order by user_id) as a) as b
where row_number = 1

6 rows affected.

   user_id   recommended_group
0        1          China Town
1        2          China Town
2        3  Indian Food Lovers
3        5     I Heart Italian
4        6     I Heart Italian
5       11  Indian Food Lovers

Below query return the activity of the users. Activity refers to the total number of group posts and total number of reviews by a particular user. This might be helpful if we would like to understand which users are active.

In [50]:
%%sql
select u.user_id, u.fname, u.lname, count(*) as total_comments_posts
from users as u join comments as c on u.user_id = c.user_id join group_posts as g on g.user_id = u.user_id
group by u.user_id, u.fname, u.lname
order by total_comments_posts desc

5 rows affected.

   user_id   fname      lname  total_comments_posts
0        1  Sarang      Gupta                    12
1       11    Joey  Tribbiani                     6
2        2    Evan     Zhuang                     4
3        7    Ziao       Wang                     2
4        9     Ken      Adams                     1